Autodesk.Revit.DB.IElementComparer.Compare(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element)
Implement this method to identify the relation of the two
object for the purpose of sorting them.
Remarks:
If the comparer is for some reason unable to identify
the relations between the two object it should return value of
ElementComparisonResult.Incomparable. Such a situation is believed
to be rather rare though.
first:
One of the elements to be compared
second:
The other element to be compared
Returns:
The result of comparison. ElementComparisonResult.Incomparable if elements cannot be compared.
Since:
2015

Autodesk.Revit.DB.IElementComparer.GetDescription
Implement this method to return a description of the comparer.
Remarks:
The purpose of this string is to describe the comparer
in more details than just a short name alone could do.
The intended use is to show the string to the end user in the UI.
Returns:
Description of the comparer.
Since:
2015

Autodesk.Revit.DB.IElementComparer.GetName
Implement this method to return the name of the comparer.
Remarks:
Although a comparer is uniquely identified by its Id,
the Name can help to identify it to the end user in the UI.
Returns:
Name of the comparer.
Since:
2015

Autodesk.Revit.DB.IElementComparer.GetId
Implement this method to return the id of the comparer.
Remarks:
The Id must uniquely identify the comparer.
Returns:
The id of the comparer.
Since:
2015

Autodesk.Revit.DB.IElementComparer
An interface which Element Comparers are derived from.
Remarks:
Comparers affect the way elements in Revit models
are sorted for the purpose of numbering them.
Since:
2015